// .................................integerate javascript.........................
// DOM এবং Event চেকলিস্ট। 

// তুমি পান্ডা কমার্স নামে একটা ওয়েবসাইট তৈরি করছিলা বেশ কিছুদিন আগে। এখন সেই ওয়েবসাইটটা আবার ওপেন করো। এরপর নিচের কাজগুলো করো। 

// ১. নতুন একটা স্ক্রিপ্ট ফাইল খুলবে। সেটাকে index.html এর সাথে কানেক্ট করতে পারো কিনা?

// ২. যতগুলা ইলিমেন্টে h2 ট্যাগ আছে সেগুলাকে সিলেক্ট করে তার লেখাগুলার কালার lightblue করেদিতে পারো কিনা। 

// ৩. ওই ওয়েবসাইট এ backpack আইডি দিয়ে একটা সেকশন আছে। সেই সেকশনের ব্যাকগ্রাউন্ড কালার tomato করে দিতে পারো কিনা। 

// ৪. card ক্লাস যতগুলা জায়গায় ইউজ করা হয়েছে সবগুলা কার্ড এর বর্ডার রেডিয়াস ৩০px করে দিতে পারো কিনা 
// ৫. কোন একটা ফাংশন লিখো। সেটার ভিতরে কনসোল লগ হবে। এবং সেই ফাংশন টা ক্লিক হ্যান্ডলার হিসেবে কোন একটা বাটনে যোগ করো 
// ৬. এইবার নতুন করে সবগুলা buy now বাটনে এমন একটা ইভেন্ট হ্যান্ডলার যোগ করো। যাতে যেকোন একটা buy now বাটনে চাপ দিলে সেটা ওয়েবসাইট থেকে রিমুভ হয়ে যায়। একটু চিন্তা করে করার চেষ্টা করো। 
// ৭. একদম নিচে একটা LET'S STAY IN TOUCH নামে একটা জিনিস আছে। সেখানে তুমি submit বাটনটা disable করে ফেলবে। তারপর কেউ যদি উপরে input ফিল্ডে যদি একজাক্টলি email শব্দটা লিখে। তাহলে বাটন একটিভ হবে। আর যদি অন্য কিছু লিখে তাহলে বাটনটা একটিভ হবে না। 
// ৮. (অপশনাল) একটা মজার চ্যালেঞ্জ। কোন একটা ইমেজ এর উপরে mouseenter করলে সেই ইমেজটা চেইঞ্জ হয়ে যাবে। একটু গুগলে সার্চ দিয়ে দেখো। জিনিসটা কিভাবে করা যেতে পারে। 
// ৯. (অপশনাল) নিচের যে LET'S STAY IN TOUCH আছে সেখানে কোন খালি জায়গায় ডাবল ক্লিক করলে ঐটার পিছনের কালার চেইঞ্জ হয়ে যাবে। 


//..........................................................
// DOM ম্যানিপুলেশন চেকলিস্ট: 

// এই চেকলিস্ট খুবই সিম্পল। এই কাজগুলো করার জন্য আগের করা কোন একটা HTML ফাইল নাও। ধরো আমরা penguin-fashion-tailwind নামে একটা প্রজেক্ট করছিলাম। কিছুদিন আগে। সেটা নিলেও হবে। এরপর নিচের জিনিসগুলো চেক করো। 

// ১. আমি যদি বলি কোন একটা এলিমেন্ট কে সিলেক্ট করে নিয়ে এসে console log করে দেখাতে হবে। তুমি কি সেটা করে দেখাতে পারবে? 

// ২. সেখানে একদম হেডার এ একটা buy now বাটন আছে। সেই বাটনে একটা ক্লিক হ্যান্ডলার যোগ করতে হবে? সেটা কি করতে পারবে? যদি পারো তাহলে সেই বাটনে ক্লিক করলে উপরে যেখানে BE THE PENGUIN এই কথাগুলো আছে সেখানে BE THE PENGUIN এর পরিবর্তে "I AM PENGUIN" কথাটা লিখে দিতে পারবে? 

// এরপর নিচের দুইটা চ্যালেঞ্জ নিবে। 
// চ্যালেঞ্জ নাম্বার ওয়ান ......................................
// নিজে নিজে আমাদের ভিডিও না দেখে বাপ এর ব্যাংক করে ফেলো। সম্ভব হলে মডিউল ২৬ এর মতো করে করো। আর একদম না পারলে মডিউল ২৫ এর মতো করে করো। তবে চ্যালেঞ্জ হচ্ছে তুমি চাইলে গুগলে সার্চ দিতে পারবে। কিন্তু আমাদের ভিডিও দেখতে পারবে না। তাহলে তুমি কোড করতে গিয়ে ঠেকে যাবে। এই ঠেকে যাওয়া আর ২-৩ ঘন্টা গুতায় গুতায় একটা জিনিস শেষ পর্যন্ত ফিনিশ করে ফেলাটাই তোমার লার্নিং। এইসব ফ্রাসট্রেশন এর মধ্যে ঘাম ঝরিয়ে ঝরিয়েই একজন ডেভেলপার তৈরি হয়।  

// চ্যালেঞ্জ নাম্বার টু ...............................
// গুগলে সার্চ দাও। জাভাস্ক্রিপ্ট ক্যালকুলেটর। দেখবে এক এক সাইটে এক এক রকমের। এক এক জন এক এক ভাবে কোড করছে। সেটা ব্যাপার না। তোমার যেভাবে ভালো লাগে। সেভাবে খুঁজে খুঁজে বুঝে বুঝে করো। চোখ বন্ধ করে না। বরং বুঝে বুঝে করো। ফিউচারে কাজে লাগবে

// //...................................................................
// মাইলস্টোন ৫ টেকএওয়ে  

// এই মাইলস্টোন থেকে তুমি যদি পাঁচটা জিনিস শিখতে চাও তাহলে এই পাঁচটা জিনিস হবে- 

// ১. জাভাস্ক্রিপ্ট দিয়ে DOM থেকে এলিমেন্ট বের করে আনার সিস্টেম। আইডি বা ক্লাস দিয়ে। আর দরকার হলে css এর সিলেক্টর দিয়ে।  

// ২. DOM এর মধ্যে কোন এলিমেন্ট এর মধ্যে Event হ্যান্ডলার যোগ করার সিস্টেম। 

// ৩. ফাংশন নিয়ে আরেকটু আলোচনা। বিশেষ করে কেন ফাংশন তৈরি করে কাজে লাগায়। এইটা ফিউচারে ঘুরে ফিরে আসতেই থাকবে। সো, এইবার ক্লিয়ার না হলেও সামনে ক্লিয়ার করার সুযোগ পাবে। 

// ৪. কিভাবে ইউজারের ইনপুট নিয়ে ক্যালকুলেশন করতে হয়। শপিং কার্ট বা বাপ এর ব্যাংক, পিন ম্যাচার এইগুলা। 

// ৫. কখন কিভাবে ফাংশন ব্যবহার করতে হয়। এখন কিছুটা উসখুস করলেও ধীরে ধীরে আরো এক দুই মাইলস্টোন এ গেলে এইটা নরমাল হতে শুরু করবে। ধীরে ধীরে হাত পাঁকাতে হবে। একদিনে সব পাকঁবে না। 

// এই মাইলস্টোন থেকে তুমি যদি আরো পাঁচটা জিনিস এ খেয়াল রাখতে চাও তাহলে সেগুলা হবে 

// ১. ইভেন্ট বাবল এর কনসেপ্ট। কোড করতে না পারলেও কনসেপ্টটা কি সেটা বুঝলেও এইটা নিয়ে যদি ইন্টারভিউতে প্রশ্ন করে বসে তখন যাতে কিছু বলতে পারো। 

// ২. arguments এই জিনিসটা কি। এইটা কখন কিভাবে ইউজ করতে হয় সেটা সম্পর্কে কিছু ধারণা 

// ৩. ডায়নামিকভাবে জাভাস্ক্রিপ্ট দিয়ে css এর স্টাইল ব্যবহার করার সিস্টেম  

// ৪. স্ট্রিং কম্পেয়ার, স্লাইস করার সিস্টেম 

// ৫. এরে স্লাইস, sort করার সিস্টেম 


// uporeo bola thakle ignore..................
/* 1.what is dom,event???????????
2.event bubble,arguments,stop propagating---aita ki jinis ami jani na akhn janbo sathe 1 ta code o korbo promise...........
3.how to create a delet confirmation button do you know i know you know it very well do it once again
4.what is nexted function and how to use it tell me with an example and one line definition.............
5.useful methods......................
  5.1->String comparison using toLowerCase toUpperCase
  5.2->Apply Search includes, indexOf, startswith, endswith
  5.3->How to split, slice, substr, substring, concat, join
  5.4->Check an Array using isArray, indexOf, includes, concat
  5.5->Get part of an array and insert elements using slice, splice
  5.6->Have fun with sort and reverse a javascript array
  5.7->Unlimited parameters to a function using arguments
  5.8->Different types of Error object and explore Try-catch
  5.9->A simple introduction to Date object in JavaScript
*/